# GetSchedulableField Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleField..::..GetSchedulableField Method
ScheduleField Class See Also
---
Gets a SchedulableField object representing this field.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public SchedulableField GetSchedulableField()
```

Visual Basic
---
```text
Public Function GetSchedulableField As SchedulableField
```

Visual C++
---
```text
public:
SchedulableField^ GetSchedulableField()
```

# ### Return Value
The SchedulableField object.
# Remarks
A ScheduleableField cannot be obtained for: \- Calculated fields \- Combined parameters
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | This ScheduleField is not a schedulable field by type(non-calculated/non-combined-parameter). |

# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace